Tram193/Flir_3/samples/sample_c/platform/rtos_freertos/stm32f4_discovery/drivers/BSP/uart.c
#ifdef USING_UART_PORT_3
        case UART_NUM_3: {
            RingBuf_Init(&s_uart3ReadRingBuffer, s_uart3ReadBuf, UART3_READ_BUF_SIZE);
            RingBuf_Init(&s_uart3WriteRingBuffer, s_uart3WriteBuf, UART3_WRITE_BUF_SIZE);

            s_uart3Handle.Instance = USART3;
            s_uart3Handle.Init.BaudRate = baudRate;
            s_uart3Handle.Init.WordLength = UART_WORDLENGTH_8B;
            s_uart3Handle.Init.StopBits = UART_STOPBITS_1;
            s_uart3Handle.Init.Parity = UART_PARITY_NONE;
            s_uart3Handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
            s_uart3Handle.Init.Mode = UART_MODE_TX_RX;
            s_uart3Handle.Init.OverSampling = UART_OVERSAMPLING_16;
            HAL_UART_Init(&s_uart3Handle);
            __HAL_UART_ENABLE_IT(&s_uart3Handle, UART_IT_RXNE);

            Osal_MutexCreate(&s_uart3Mutex);
        }
            break;
#endif
        

#ifdef USING_UART_PORT_5
        case UART_NUM_5: {
            RingBuf_Init(&s_uart5ReadRingBuffer, s_uart5ReadBuf, UART5_READ_BUF_SIZE);
            RingBuf_Init(&s_uart5WriteRingBuffer, s_uart5WriteBuf, UART5_WRITE_BUF_SIZE);

            s_uart5Handle.Instance = UART5;
            s_uart5Handle.Init.BaudRate = baudRate;
            s_uart5Handle.Init.WordLength = UART_WORDLENGTH_8B;
            s_uart5Handle.Init.StopBits = UART_STOPBITS_1;
            s_uart5Handle.Init.Parity = UART_PARITY_NONE;
            s_uart5Handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
            s_uart5Handle.Init.Mode = UART_MODE_TX_RX;
            s_uart5Handle.Init.OverSampling = UART_OVERSAMPLING_16;
            HAL_UART_Init(&s_uart5Handle);
            __HAL_UART_ENABLE_IT(&s_uart5Handle, UART_IT_RXNE);

            Osal_MutexCreate(&s_uart5Mutex);
        }
            break;
#endif
        
#ifdef USING_UART_PORT_6
        case UART_NUM_6: {
            RingBuf_Init(&s_uart6ReadRingBuffer, s_uart6ReadBuf, UART6_READ_BUF_SIZE);
            RingBuf_Init(&s_uart6WriteRingBuffer, s_uart6WriteBuf, UART6_WRITE_BUF_SIZE);

            s_uart6Handle.Instance = USART6;
            s_uart6Handle.Init.BaudRate = baudRate;
            s_uart6Handle.Init.WordLength = UART_WORDLENGTH_8B;
            s_uart6Handle.Init.StopBits = UART_STOPBITS_1;
            s_uart6Handle.Init.Parity = UART_PARITY_NONE;
            s_uart6Handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
            s_uart6Handle.Init.Mode = UART_MODE_TX_RX;
            s_uart6Handle.Init.OverSampling = UART_OVERSAMPLING_16;
            HAL_UART_Init(&s_uart6Handle);
            __HAL_UART_ENABLE_IT(&s_uart6Handle, UART_IT_RXNE);

            Osal_MutexCreate(&s_uart6Mutex);
        }
            break;
#endif

        default:
            break;
    }
}

/**
 * @brief Read UART data.
 * @param uartNum UART number.
 * @param buf Pointer to buffer used to store data.
 * @param readSize Size of data to be read.
 * @return Size of data read actually.
 */
int UART_Read(E_UartNum uartNum, uint8_t *buf, uint16_t readSize)
{
    uint16_t readRealSize;

    switch (uartNum) {

#ifdef USING_UART_PORT_1
        case UART_NUM_1: {
            Osal_MutexLock(s_uart1Mutex);
            readRealSize = RingBuf_Get(&s_uart1ReadRingBuffer, buf, readSize);
            Osal_MutexUnlock(s_uart1Mutex);
        }
            break;
#endif

#ifdef USING_UART_PORT_2
        case UART_NUM_2: {
            Osal_MutexLock(s_uart2Mutex);
            readRealSize = RingBuf_Get(&s_uart2ReadRingBuffer, buf, readSize);
            Osal_MutexUnlock(s_uart2Mutex);
        }
            break;
#endif

#ifdef USING_UART_PORT_3
        case UART_NUM_3: {
            Osal_MutexLock(s_uart3Mutex);
            readRealSize = RingBuf_Get(&s_uart3ReadRingBuffer, buf, readSize);
            Osal_MutexUnlock(s_uart3Mutex);
        }
            break;
#endif
        
#ifdef USING_UART_PORT_5
        case UART_NUM_5: {
            Osal_MutexLock(s_uart5Mutex);
            readRealSize = RingBuf_Get(&s_uart5ReadRingBuffer, buf, readSize);
            Osal_MutexUnlock(s_uart5Mutex);
        }
            break;
#endif
        
#ifdef USING_UART_PORT_6
        case UART_NUM_6: {
            Osal_MutexLock(s_uart6Mutex);
            readRealSize = RingBuf_Get(&s_uart6ReadRingBuffer, buf, readSize);
            Osal_MutexUnlock(s_uart6Mutex);
        }
            break;
#endif

        default:
            return UART_ERROR;
    }

    return readRealSize;
}

/**
 * @brief Write UART data.
 * @param uartNum UART number.
 * @param buf Pointer to buffer used to store data.
 * @param writeSize Size of data to be write.
 * @return Size of data wrote actually.
 */
int UART_Write(E_UartNum uartNum, const uint8_t *buf, uint16_t writeSize)
{
    int writeRealLen;
    uint16_t usedCapacityOfBuffer = 0;

    switch (uartNum) {

#ifdef USING_UART_PORT_1
        case UART_NUM_1: {
            Osal_MutexLock(s_uart1Mutex);
            writeRealLen = RingBuf_Put(&s_uart1WriteRingBuffer, buf, writeSize);
            __HAL_UART_ENABLE_IT(&s_uart1Handle, UART_IT_TXE);
            usedCapacityOfBuffer = UART1_WRITE_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart1WriteRingBuffer);
            s_uart1WriteBufferState.maxUsedCapacityOfBuffer =
                usedCapacityOfBuffer > s_uart1WriteBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                       : s_uart1WriteBufferState.maxUsedCapacityOfBuffer;
            s_uart1WriteBufferState.countOfLostData += writeSize - writeRealLen;
            Osal_MutexUnlock(s_uart1Mutex);
        }
            break;
#endif

#ifdef USING_UART_PORT_2
        case UART_NUM_2: {
            Osal_MutexLock(s_uart2Mutex);
            writeRealLen = RingBuf_Put(&s_uart2WriteRingBuffer, buf, writeSize);
            __HAL_UART_ENABLE_IT(&s_uart2Handle, UART_IT_TXE);
            usedCapacityOfBuffer = UART2_WRITE_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart2WriteRingBuffer);
            s_uart2WriteBufferState.maxUsedCapacityOfBuffer =
                usedCapacityOfBuffer > s_uart2WriteBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                       : s_uart2WriteBufferState.maxUsedCapacityOfBuffer;
            s_uart2WriteBufferState.countOfLostData += writeSize - writeRealLen;
            Osal_MutexUnlock(s_uart2Mutex);
        }
            break;
#endif

