Tram193/Flir_3/samples/sample_c/platform/rtos_freertos/stm32f4_discovery/drivers/BSP/uart.c
#ifdef USING_UART_PORT_3
        case UART_NUM_3: {
            Osal_MutexLock(s_uart3Mutex);
            writeRealLen = RingBuf_Put(&s_uart3WriteRingBuffer, buf, writeSize);
            __HAL_UART_ENABLE_IT(&s_uart3Handle, UART_IT_TXE);
            usedCapacityOfBuffer = UART3_WRITE_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart3WriteRingBuffer);
            s_uart3WriteBufferState.maxUsedCapacityOfBuffer =
                usedCapacityOfBuffer > s_uart3WriteBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                       : s_uart3WriteBufferState.maxUsedCapacityOfBuffer;
            s_uart3WriteBufferState.countOfLostData += writeSize - writeRealLen;
            Osal_MutexUnlock(s_uart3Mutex);
        }
            break;
#endif
        
#ifdef USING_UART_PORT_5
        case UART_NUM_5: {
            Osal_MutexLock(s_uart5Mutex);
            writeRealLen = RingBuf_Put(&s_uart5WriteRingBuffer, buf, writeSize);
            __HAL_UART_ENABLE_IT(&s_uart5Handle, UART_IT_TXE);
            usedCapacityOfBuffer = UART5_WRITE_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart5WriteRingBuffer);
            s_uart5WriteBufferState.maxUsedCapacityOfBuffer =
                usedCapacityOfBuffer > s_uart5WriteBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                       : s_uart5WriteBufferState.maxUsedCapacityOfBuffer;
            s_uart5WriteBufferState.countOfLostData += writeSize - writeRealLen;
            Osal_MutexUnlock(s_uart5Mutex);
        }
            break;
#endif

#ifdef USING_UART_PORT_6
        case UART_NUM_6: {
            Osal_MutexLock(s_uart6Mutex);
            writeRealLen = RingBuf_Put(&s_uart6WriteRingBuffer, buf, writeSize);
            __HAL_UART_ENABLE_IT(&s_uart6Handle, UART_IT_TXE);
            usedCapacityOfBuffer = UART6_WRITE_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart6WriteRingBuffer);
            s_uart6WriteBufferState.maxUsedCapacityOfBuffer =
                usedCapacityOfBuffer > s_uart6WriteBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                       : s_uart6WriteBufferState.maxUsedCapacityOfBuffer;
            s_uart6WriteBufferState.countOfLostData += writeSize - writeRealLen;
            Osal_MutexUnlock(s_uart6Mutex);
        }
            break;
#endif

        default:
            return UART_ERROR;
    }

    return writeRealLen;
}

void UART_GetBufferState(E_UartNum uartNum, T_UartBufferState *readBufferState, T_UartBufferState *writeBufferState)
{
    switch (uartNum) {
#ifdef USING_UART_PORT_1
        case UART_NUM_1:
            memcpy(readBufferState, &s_uart1ReadBufferState, sizeof(T_UartBufferState));
            memcpy(writeBufferState, &s_uart1WriteBufferState, sizeof(T_UartBufferState));
            break;
#endif
#ifdef USING_UART_PORT_2
        case UART_NUM_2:
            memcpy(readBufferState, &s_uart2ReadBufferState, sizeof(T_UartBufferState));
            memcpy(writeBufferState, &s_uart2WriteBufferState, sizeof(T_UartBufferState));
            break;
#endif
#ifdef USING_UART_PORT_3
        case UART_NUM_3:
            memcpy(readBufferState, &s_uart3ReadBufferState, sizeof(T_UartBufferState));
            memcpy(writeBufferState, &s_uart3WriteBufferState, sizeof(T_UartBufferState));
            break;
#endif
        
#ifdef USING_UART_PORT_5
        case UART_NUM_5:
            memcpy(readBufferState, &s_uart5ReadBufferState, sizeof(T_UartBufferState));
            memcpy(writeBufferState, &s_uart5WriteBufferState, sizeof(T_UartBufferState));
            break;
#endif
        
#ifdef USING_UART_PORT_6
        case UART_NUM_6:
            memcpy(readBufferState, &s_uart6ReadBufferState, sizeof(T_UartBufferState));
            memcpy(writeBufferState, &s_uart6WriteBufferState, sizeof(T_UartBufferState));
            break;
#endif
        default:
            break;
    }
}

/**
 * @brief UART1 interrupt request handler fucntion.
 */
#ifdef USING_UART_PORT_1

void USART1_IRQHandler(void)
{
    uint8_t data;
    uint16_t usedCapacityOfBuffer = 0;
    uint16_t realCountPutBuffer = 0;

    if (__HAL_UART_GET_IT_SOURCE(&s_uart1Handle, UART_IT_RXNE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart1Handle, UART_FLAG_RXNE) != RESET) {
        data = (uint8_t) ((uint16_t) (s_uart1Handle.Instance->DR & (uint16_t) 0x01FF) & (uint16_t) 0x00FF);
        realCountPutBuffer = RingBuf_Put(&s_uart1ReadRingBuffer, &data, 1);
        usedCapacityOfBuffer = UART1_READ_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart1ReadRingBuffer);
        s_uart1ReadBufferState.maxUsedCapacityOfBuffer =
            usedCapacityOfBuffer > s_uart1ReadBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                  : s_uart1ReadBufferState.maxUsedCapacityOfBuffer;
        s_uart1ReadBufferState.countOfLostData += 1 - realCountPutBuffer;
    }

    if (__HAL_UART_GET_IT_SOURCE(&s_uart1Handle, UART_IT_TXE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart1Handle, UART_FLAG_TXE) != RESET) {
        if (RingBuf_Get(&s_uart1WriteRingBuffer, &data, 1)) {
            /* Transmit Data */
            s_uart1Handle.Instance->DR = ((uint16_t) data & (uint16_t) 0x01FF);
        } else {
            __HAL_UART_DISABLE_IT(&s_uart1Handle, UART_IT_TXE);
        }
    }
}

#endif

/**
 * @brief UART2 interrupt request handler fucntion.
 */
#ifdef USING_UART_PORT_2

void USART2_IRQHandler(void)
{
    uint8_t data;
    uint16_t usedCapacityOfBuffer = 0;
    uint16_t realCountPutBuffer = 0;

    if (__HAL_UART_GET_IT_SOURCE(&s_uart2Handle, UART_IT_RXNE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart2Handle, UART_FLAG_RXNE) != RESET) {
        data = (uint8_t) ((uint16_t) (s_uart2Handle.Instance->DR & (uint16_t) 0x01FF) & (uint16_t) 0x00FF);
        realCountPutBuffer = RingBuf_Put(&s_uart2ReadRingBuffer, &data, 1);
        usedCapacityOfBuffer = UART2_READ_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart2ReadRingBuffer);
        s_uart2ReadBufferState.maxUsedCapacityOfBuffer =
            usedCapacityOfBuffer > s_uart2ReadBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                  : s_uart2ReadBufferState.maxUsedCapacityOfBuffer;
        s_uart2ReadBufferState.countOfLostData += 1 - realCountPutBuffer;
    }

    if (__HAL_UART_GET_IT_SOURCE(&s_uart2Handle, UART_IT_TXE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart2Handle, UART_FLAG_TXE) != RESET) {
        if (RingBuf_Get(&s_uart2WriteRingBuffer, &data, 1)) {
            /* Transmit Data */
            s_uart2Handle.Instance->DR = ((uint16_t) data & (uint16_t) 0x01FF);
        } else {
            __HAL_UART_DISABLE_IT(&s_uart2Handle, UART_IT_TXE);
        }
    }
}

#endif

/**
 * @brief UART3 interrupt request handler fucntion.
 */
#ifdef USING_UART_PORT_3

void USART3_IRQHandler(void)
{
    uint8_t data;
    uint16_t usedCapacityOfBuffer = 0;
    uint16_t realCountPutBuffer = 0;

    if (__HAL_UART_GET_IT_SOURCE(&s_uart3Handle, UART_IT_RXNE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart3Handle, UART_FLAG_RXNE) != RESET) {
        data = (uint8_t) ((uint16_t) (s_uart3Handle.Instance->DR & (uint16_t) 0x01FF) & (uint16_t) 0x00FF);
        realCountPutBuffer = RingBuf_Put(&s_uart3ReadRingBuffer, &data, 1);
        usedCapacityOfBuffer = UART3_READ_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart3ReadRingBuffer);
        s_uart3ReadBufferState.maxUsedCapacityOfBuffer =
            usedCapacityOfBuffer > s_uart3ReadBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                  : s_uart3ReadBufferState.maxUsedCapacityOfBuffer;
        s_uart3ReadBufferState.countOfLostData += 1 - realCountPutBuffer;
    }

    if (__HAL_UART_GET_IT_SOURCE(&s_uart3Handle, UART_IT_TXE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart3Handle, UART_FLAG_TXE) != RESET) {
        if (RingBuf_Get(&s_uart3WriteRingBuffer, &data, 1)) {
            /* Transmit Data */
            s_uart3Handle.Instance->DR = ((uint16_t) data & (uint16_t) 0x01FF);
        } else {
            __HAL_UART_DISABLE_IT(&s_uart3Handle, UART_IT_TXE);
        }
    }
}

#endif

/**
 * @brief UART5 interrupt request handler fucntion.
 */
#ifdef USING_UART_PORT_5

void UART5_IRQHandler(void)
{
    uint8_t data;
    uint16_t usedCapacityOfBuffer = 0;
    uint16_t realCountPutBuffer = 0;

    if (__HAL_UART_GET_IT_SOURCE(&s_uart5Handle, UART_IT_RXNE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart5Handle, UART_FLAG_RXNE) != RESET) {
        data = (uint8_t) ((uint16_t) (s_uart5Handle.Instance->DR & (uint16_t) 0x01FF) & (uint16_t) 0x00FF);
        realCountPutBuffer = RingBuf_Put(&s_uart5ReadRingBuffer, &data, 1);
        usedCapacityOfBuffer = UART5_READ_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart5ReadRingBuffer);
        s_uart5ReadBufferState.maxUsedCapacityOfBuffer =
            usedCapacityOfBuffer > s_uart5ReadBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                  : s_uart5ReadBufferState.maxUsedCapacityOfBuffer;
        s_uart5ReadBufferState.countOfLostData += 1 - realCountPutBuffer;
    }

