Tram193/Flir_3/samples/sample_c/platform/rtos_freertos/stm32f4_discovery/drivers/BSP/uart.c
    if (__HAL_UART_GET_IT_SOURCE(&s_uart5Handle, UART_IT_TXE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart5Handle, UART_FLAG_TXE) != RESET) {
        if (RingBuf_Get(&s_uart5WriteRingBuffer, &data, 1)) {
            /* Transmit Data */
            s_uart5Handle.Instance->DR = ((uint16_t) data & (uint16_t) 0x01FF);
        } else {
            __HAL_UART_DISABLE_IT(&s_uart5Handle, UART_IT_TXE);
        }
    }
}

#endif

/**
 * @brief UART6 interrupt request handler fucntion.
 */
#ifdef USING_UART_PORT_6

void USART6_IRQHandler(void)
{
    uint8_t data;
    uint16_t usedCapacityOfBuffer = 0;
    uint16_t realCountPutBuffer = 0;

    if (__HAL_UART_GET_IT_SOURCE(&s_uart6Handle, UART_IT_RXNE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart6Handle, UART_FLAG_RXNE) != RESET) {
        data = (uint8_t) ((uint16_t) (s_uart6Handle.Instance->DR & (uint16_t) 0x01FF) & (uint16_t) 0x00FF);
        realCountPutBuffer = RingBuf_Put(&s_uart6ReadRingBuffer, &data, 1);
        usedCapacityOfBuffer = UART6_READ_BUF_SIZE - RingBuf_GetUnusedSize(&s_uart6ReadRingBuffer);
        s_uart6ReadBufferState.maxUsedCapacityOfBuffer =
            usedCapacityOfBuffer > s_uart6ReadBufferState.maxUsedCapacityOfBuffer ? usedCapacityOfBuffer
                                                                                  : s_uart6ReadBufferState.maxUsedCapacityOfBuffer;
        s_uart6ReadBufferState.countOfLostData += 1 - realCountPutBuffer;
    }

    if (__HAL_UART_GET_IT_SOURCE(&s_uart6Handle, UART_IT_TXE) != RESET &&
        __HAL_UART_GET_FLAG(&s_uart6Handle, UART_FLAG_TXE) != RESET) {
        if (RingBuf_Get(&s_uart6WriteRingBuffer, &data, 1)) {
            /* Transmit Data */
            s_uart6Handle.Instance->DR = ((uint16_t) data & (uint16_t) 0x01FF);
        } else {
            __HAL_UART_DISABLE_IT(&s_uart6Handle, UART_IT_TXE);
        }
    }
}

#endif

#ifdef __CC_ARM
int fputc(int ch,FILE *f)
{
    if (DJI_CONSOLE_UART_NUM == UART_NUM_1) {
        HAL_UART_Transmit(&s_uart1Handle, (uint8_t *) &ch, 1, 0xFFFF);
    } else if (DJI_CONSOLE_UART_NUM == UART_NUM_2) {
        #ifdef USING_UART_PORT_2
        HAL_UART_Transmit(&s_uart2Handle, (uint8_t *) &ch, 1, 0xFFFF);
        #endif
    } else if (DJI_CONSOLE_UART_NUM == UART_NUM_3) {
        HAL_UART_Transmit(&s_uart3Handle, (uint8_t *) &ch, 1, 0xFFFF);
    }

    return ch;
}
#else
#ifdef __GNUC__
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif

PUTCHAR_PROTOTYPE
{
    if (DJI_CONSOLE_UART_NUM == UART_NUM_1) {
        HAL_UART_Transmit(&s_uart1Handle, (uint8_t *) &ch, 1, 0xFFFF);
    } else if (DJI_CONSOLE_UART_NUM == UART_NUM_2) {
        HAL_UART_Transmit(&s_uart2Handle, (uint8_t *) &ch, 1, 0xFFFF);
    } else if (DJI_CONSOLE_UART_NUM == UART_NUM_3) {
        HAL_UART_Transmit(&s_uart3Handle, (uint8_t *) &ch, 1, 0xFFFF);
    }

    return ch;
}

#endif
